[
  {
    "title": "BetterHire",
    "img": "devsoc_logo.jpg",
    "by": "Developer Society, BITS Goa",
    "description": "BetterHire is a 'fair for all' tool meant to remove any kind of bias(including subconscious bias) during hiring/promotions in tech companies(specifically for software engineers) that might creep in during candidate interviews on the basis of immutable characteristics and even some mutable characteristics such as accent.",
    "link": "https://github.com/Devsoc-BPGC/BetterHire"
  },
  {
    "title": "BCI-bot",
    "img": "BCI.png",
    "by": "SEDS Celestia",
    "description": " Aim of this project is controlling the motion of a rover using a BCI. In this, we would be dealing with different aspects of neurology, lots of deep learning and computing algorithms, circuitry as well as robotics. ",
    "link": "https://github.com/SEDSCelestiaBPGC/BCI.git"
  },
  {
    "title": "Aerodynamics Club Website Development",
    "img": "WEBD.jpg",
    "by": "AeroD",
    "link": "https://github.com/AeroDBPGC/website",
    "description": "The Aerodynamics club has been developing its website which plans to showcase our ongoing projects, have interesting articles amongst other features."
  },
  {
    "title": "AR StoryboARD",
    "img": "AR.jpg",
    "by": "AR Developers Group",
    "description": "Aim is to create a real world product which will be released. It will have virtual AR rooms which you can buy. Contributers will be working on creating own rooms or working on other's previously made rooms.",
    "link": "https://github.com/AshwaniKottapalli/StoryboARd"
  },
  {
    "title": "Externally Randomized Encryption Service",
    "img": "encryption.jpg",
    "by": "SEDS Celestia",
    "link":"https://github.com/SEDSCelestiaBPGC/Externally-Randomized-Encryption-Service",
    "description": "We aim to create a robust encryption service using a randomly generated key and suitable algorithms. This project aims to make a more secure encryption service by relying on external, more truly random processes for key generation."
  },
  {
    "title": "Quantum Chess",
    "img": "Quantum.jpg",
    "by": "SEDS Celestia",
    "link": "https://github.com/SEDSCelestiaBPGC/quantum-algorithms.git",
    "description": "The project aims to create a fully functional quantum chessboard for two players. Quantum chess has the same basic rules as classical chess, but also lends its pieces quantum abilities like superposition and entanglement to give this classic game an exciting kick."
  },
  {
    "title": "Algorithmic Financial Trading with Deep CNN",
    "img": "Finance.jpg",
    "by": "WSC",
    "description": "Implementation of a proposed novel algorithmic trading model CNN-TA using a 2-D Convolutional Neural Network based on image processing properties.",
    "link": "https://github.com/adityaaryan24/Algorthmic-Trading-Using-CNN"
  },
  {
    "title": "Noodle LMS",
    "img": "noodle.png",
    "by": "CTE",
    "link": "https://github.com/samarsault/noodle-flavour-cte",
    "description": "Noodle is the learning management system that powers CTE courses. The core functionality involves registrations, course content, quizzes and more."
  },
  {
    "title": "Windows Service",
    "img": "Windows.jpg",
    "by": "BITSKrieg",
    "link": "https://github.com/bitskriegofficial/WinService",
    "description": "A windows service is an application which runs in the background. In this project, a windows service will be built to monitor key events: registry changes, process monitoring, and drive mounting detection. This can eventually become a program to provide alerts for malicious activity."
  },
  {
    "title": "XSS Detection",
    "img": "XXS.jpg",
    "by": "BITSKrieg",
    "link": "https://github.com/bitskriegofficial/CheXSS",
    "description": "This project aims to build a tool for testing for Cross Site Scripting vulnerabilities in web applications, based on a wordlist of payloads. This project intends to be a basic tool to detect such vulnerabilities to improve security and automate the process of securing websites with effective filters."
  },
  {
    "title": "Kryptographer",
    "img": "Crypto.jpg",
    "by": "BITSKrieg",
    "link": "https://github.com/bitskriegofficial/Kryptographer",
    "description": "This project intends to be a swiss army knife of cracking classical cryptography, eventually accommodating advanced features such as brute-force attacks and dictionary attacks."
  },
  {
    "title": "Gennav",
    "img": "Gennav.png",
    "by": "ERC",
    "link": "https://github.com/ERC-BPGC/gennav/",
    "description": "Building a collection of robotics navigation algorithms for multipurpose usage."
  },
  {
    "title": "RoManOV",
    "img": "Arm.jpg",
    "by": "ERC",
    "link": "https://github.com/users/abhidxt299/projects/1",
    "description": "The goal here is to build a robotic arm that can autonomously recognise, pick and place objects and ultimately perform complex tasks like playing a game of chess using Convolutional Neural Networks, Deep Learning and Computer Vision."
  },
  {
    "title": "SWD BITS Goa",
    "img": "WEBD.jpg",
    "by": "SWD",
    "link": "https://github.com/swd-bits-goa/swd_django",
    "description": "The new SWD Website still requires some bug fixes and feature implementations on both the front-end and back-end side. Front-end uses django templates with css, back-end uses django. Contributors are expected to have a working knowledge of django and git."
  },
  {
    "title": "DecodET: ExtraTerrestrial Proteins & DL",
    "img": "Bio.jpg",
    "by": "Kratos",
    "link": "https://github.com/Kratos-The-Rover/DecodET",
    "description": "In this project, we will be looking at ways to improving the currently available deep learning models for structure prediction, similarity assessment, and classification of protein sequences."
  },
  {
    "title": "Decepticonlp",
    "img": "AI.jpg",
    "by": "SAIDL",
    "link": "https://github.com/SforAiDl/decepticonlp",
    "description": "Decepticonlp is a python library for Robustness Monitoring and Adversarial Debugging of NLP models, we propose an effective tool for researchers and developers to monitor the robustness of their models."
  },
  {
    "title": "GenRL",
    "img": "GenRL.png",
    "by": "SAIDL",
    "link": "https://github.com/SforAiDl/genrl",
    "description": "GenRL is a PyTorch reinforcement learning library centered around reproducible and generalizable algorithm implementations. We aim to provide fast paper reproduction and benchmarking to researchers. We eventually aim to support the implementation of any new RL algorithm in less than 100 lines of code."
  },
  {
    "title": "Chocolate Mint",
    "img": "Port.jpg",
    "by": "DevSoc",
    "link": "https://github.com/arpitbhardwaj24/porfolio-gen",
    "description": "Chocolate Mint is a Command Line slug generator that lets user shorten their long command line code and generate a custom command line code for it. This small easy-to-share command can be used anywhere across the internet."
  },
  {
    "title": "URL Shortner",
    "img": "url.png",
    "by": "DevSoc",
    "link": "https://github.com/Devsoc-BPGC/Tiny-Url",
    "description": "BITS Goa's very own tiny url generator for shortening urls."
  },
  {
    "title": "Scanf()",
    "img": "MA.png",
    "by": "DevSoc",
    "description": "Scanner to convert images to PDFs (CamScanner like functionality).",
    "link": "https://github.com/Devsoc-BPGC/scanf-app"
  },
  {
    "title": "GREat",
    "description": "The aim of the project is to remove create a multiplatform (web, ios, android) one stop destination for students preparing for exams like GRE, TOEFL, etc. The app will consist of flashcards with mnemonic techniques and timed tests from the best resources.",
    "by": "SiteX",
    "img": "gre.png",
    "link": "https://github.com/SiteX-DigiTech/GRE-Prep"
  },
  {
    "title": "All in one Ecommerce app",
    "description": "Ecommerce app to display various products and compare prices so that products can be bought directly from the app instead of visiting multiple sites. The app will be able to tell whether products are Indian or not.",
    "by": "SiteX",
    "img": "e-commerce.png",
    "link": "https://github.com/SiteX-DigiTech/Ecommerce-App"
  }
]
